app/Filament/Superadmin/Resources/SettingResource.php

select `name`, `id` from `states` where `country_id` is null
select `name`, `id` from `cities` where `country_id` = '160' and `state_id` = '2985'
---
                                    ])->columns(4),

                            ])->columns(4),
                        Forms\Components\Wizard\Step::make('Address')->schema([
                            Select::make('country_id')
                                ->label('Country')
                                ->preload()
                                ->options(Country::all()->pluck('name', 'id'))
                                ->searchable()
                                ->placeholder('Nigeria')
                                ->nullable()
                                ->live()
                                ->native(false)
                                ->afterStateUpdated(function (Set $set) {
                                    $set('state_id', null);
                                    $set('city_id', null);
                                }),
                            Select::make('state_id')
                                ->label('State')
                                ->relationship(name: 'state', titleAttribute: 'name')
                                ->options(fn (Get $get): Collection
                                => State::query()
                                    ->where('country_id', $get('country_id'))
                                    ->pluck('name', 'id', 'country_id'))
                                ->searchable(['name'])
                                ->nullable()
                                ->preload()
                                ->native(false)
                                ->live()
                                ->afterStateUpdated(fn (Set $set) => $set('city_id', null)),
                            Select::make('city_id')
                                ->label('City/Town')
                                ->relationship(name: 'city', titleAttribute: 'name')
                                ->options(fn (Get $get): Collection
                                => City::query()
                                    // ->where('country_id', $get('country_id'))
                                    ->where('state_id', $get('state_id'))
                                    ->pluck('name', 'id', 'state_id'))
                                ->searchable(['name'])
                                ->nullable()
                                ->helperText("if you can'\t find your town/city, select the nearest city. Also contact us via email,phone and chat")
                                ->preload()
                                ->live()
                                ->native(false),